import datetime
import requests
import re
import os
import threading
import queue
import time
import os

os.system('cd /storage/emulated/0/Android/data/com.tencent.mm/MicroMsg/wxanewfiles/215ad61d17c6d8212f937dc5ac561ed7/gamecaches/resources && ls ')
print("请自行在里面找到约1.00k文件，格式为.json")
print("建议你自行在文件上找，路径为: /storage/emulated/0/Android/data/com.tencent.mm/MicroMsg/wxanewfiles/215ad61d17c6d8212f937dc5ac561ed7/gamecaches/resources")
print("找到后复制到下方，包括路径也一起复制！")
print("该脚本部分手机可能不生效！如果实在试不成功，那么建议退出脚本，别试了，该功能仅在手机端通过测试，该脚本可将羊了个羊的关卡都停留在第一关")

xx = input ("请输入文件+路径: ")
Note=open(xx,mode='w')
Note.write('[1,0,0,[["cc.JsonAsset",["_name","json"],1]],[[0,0,1,3]],[[0,"levelConfigData",{"dailyLevel":[[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001],[80001,80001]],"topicLevel":[[10017,100001],[10017,100002],[10017,100003],[10017,100004],[10017,100005],[10017,100006],[10017,100007],[10017,100008],[10017,100009],[10017,100010],[10017,100011],[10017,100012],[10017,100013],[10017,100014],[10017,100015],[10017,100016],[10017,100017],[10017,100018],[10017,100019],[10017,100020],[10017,100021],[10017,100022],[10017,100023],[10017,100024],[10017,100025],[10017,100026],[10017,100027],[10017,100028],[10017,100029],[10017,100030],[10017,100031]]}]],0,0,[],[],[]')
Note.close()
print("修改完成，不一定成功啊")